zerver/tests/fixtures/stripe.json

{
    "list_sources": {
        "data": [
            {
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "customer": "cus_CFIUHRMRPADEsO",
            "cvc_check": "pass",
            "dynamic_last4": null,
            "exp_month": 11,
            "exp_year": 2023,
            "fingerprint": "PbUZJH6QO0VTOjLX",
            "funding": "credit",
            "id": "card_1BqntOD2X8vgpBNGma3qYOvo",
            "last4": "4242",
            "metadata": {},
            "name": "iago@zulip.com",
            "object": "card",
            "tokenization_method": null
            },
            {
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "customer": "cus_CFIUHRMRPADEsO",
            "cvc_check": "pass",
            "dynamic_last4": null,
            "exp_month": 8,
            "exp_year": 2024,
            "fingerprint": "PbUZJH6QO0VTOjLX",
            "funding": "credit",
            "id": "card_1BqntOD2X8vgpBNGma3qYOvo",
            "last4": "4242",
            "metadata": {},
            "name": "iago@zulip.com",
            "object": "card",
            "tokenization_method": null
            }
        ],
        "has_more": false,
        "object": "list",
        "url": "/v1/customers/cus_CFIUHRMRPADEsO/sources"
    },
    "create_source": {
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": null,
        "address_zip_check": null,
        "brand": "Visa",
        "country": "US",
        "customer": "cus_CFIUHRMRPADEsO",
        "cvc_check": "pass",
        "dynamic_last4": null,
        "exp_month": 12,
        "exp_year": 2019,
        "fingerprint": "PbUZJH6QO0VTOjLX",
        "funding": "credit",
        "id": "card_1Br4yHD2X8vgpBNGGQsTMfKy",
        "last4": "4242",
        "metadata": {
            "added_user_email": "iago@zulip.com",
            "added_user_id": "5"
        },
        "name": null,
        "object": "card",
        "tokenization_method": null
    },
    "create_customer": {
        "account_balance": 0,
        "created": 1517513926,
        "currency": null,
        "default_source": "card_1BqntOD2X8vgpBNGma3qYOvo",
        "delinquent": false,
        "description": "Zulip Dev (zulip)",
        "discount": null,
        "email": null,
        "id": "cus_CFIUHRMRPADEsO",
        "livemode": false,
        "metadata": {
            "string_id": "zulip"
        },
        "object": "customer",
        "shipping": null,
        "sources": {
            "data": [
            {
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_CFIUHRMRPADEsO",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 11,
                "exp_year": 2023,
                "fingerprint": "PbUZJH6QO0VTOjLX",
                "funding": "credit",
                "id": "card_1BqntOD2X8vgpBNGma3qYOvo",
                "last4": "4242",
                "metadata": {},
                "name": "iago@zulip.com",
                "object": "card",
                "tokenization_method": null
            }
            ],
            "has_more": false,
            "object": "list",
            "total_count": 1,
            "url": "/v1/customers/cus_CFIUHRMRPADEsO/sources"
        },
        "subscriptions": {}
    },
    "retrieve_customer": {
        "account_balance": 0,
        "created": 1517513926,
        "currency": null,
        "default_source": "card_1BqntOD2X8vgpBNGma3qYOvo",
        "delinquent": false,
        "description": "Zulip Dev (zulip)",
        "discount": null,
        "email": null,
        "id": "cus_CFIUHRMRPADEsO",
        "livemode": false,
        "metadata": {
            "string_id": "zulip"
        },
        "object": "customer",
        "shipping": null,
        "sources": {
            "data": [
            {
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_CFIUHRMRPADEsO",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 11,
                "exp_year": 2023,
                "fingerprint": "PbUZJH6QO0VTOjLX",
                "funding": "credit",
                "id": "card_1BqntOD2X8vgpBNGma3qYOvo",
                "last4": "4242",
                "metadata": {},
                "name": "iago@zulip.com",
                "object": "card",
                "tokenization_method": null
            }
            ],
            "has_more": false,
            "object": "list",
            "total_count": 1,
            "url": "/v1/customers/cus_CFIUHRMRPADEsO/sources"
        },
        "subscriptions": {}
    }
}
